Вариант 6
1. Вывод чисел от 1 до 15:


- Напишите программу, которая выводит числа от 1 до 15 с использованием цикла for.

2. Сумма кубов чисел от 1 до N:
    - Напишите программу, которая вычисляет сумму кубов чисел от 1 до заданного числа N с использованием цикла while.

3. Поиск количества четных элементов в массиве:
    - Напишите программу, которая вычисляет количество четных элементов в массиве с использованием цикла for.

4. Проверка на простое число:
    - Напишите программу, которая проверяет, является ли заданное число простым с использованием оператора if-else.

5. Цвета радуги:
    - Напишите программу, которая выводит название цвета радуги по заданному номеру (1 для красного, 2 для оранжевого и т.д.) с использованием оператора switch-case.

---

1.
for i in 1...15 {
    print(i)
}

▎2. 
let N =5
var sum = 0
var i = 1
    
while i <= N {
    sum += i * i * i
    i += 1
}

    
3. 
let array = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
var evenCount = 0

for number in array {
    if number % 2 == 0 {
        evenCount += 1
    }
}

4.
print("Введите число для проверки:")
if let input = readLine(), let number = Int(input) {
    var isPrime = true
    
    if number < 2 {
        isPrime = false
    } else {
        for i in 2..<number {
            if number % i == 0 {
                isPrime = false
                break
            }
        }
    }
    
    if isPrime {
        print("\(number) является простым числом.")
    } else {
        print("\(number) не является простым числом.")
    }
} else {
    print("Некорректный ввод.")
}


5. 
print("Введите номер цвета радуги (1-7):")
let colorNumber = Int(readLine())
switch colorNumber {
    case 1:
        print("Красный")
    case 2:
        print("Оранжевый")
    case 3:
        print("Желтый")
    case 4:
        print("Зеленый")
    case 5:
        print("Голубой")
    case 6:
        print("Синий")
    case 7:
        print("Фиолетовый")
    default:
        print("Некорректный номер цвета.")
}
